app/Controllers/StudentApiController.php

SELECT *
FROM `student`
ORDER BY `id` DESC
---
	public function index()
	{
		$students = new Student();
		$data = $students->orderBy('id','DESC')->findAll();

INSERT INTO `student` (`name`, `age`, `country`) VALUES ('woogi', '28', 'SilLIm')
---
	public function create()
	{
		$students = new Student();

		$data = [
			'name' => $this->request->getVar('name'),
			'age'=> $this->request->getVar('age'),
			'country'=> $this->request->getVar('country')
		];

		$result = $students->save($data);

SELECT *
FROM `student`
WHERE `student`.`id` = '2'
---
	public function show($id)
	{
		$students = new Student();

		$data = $students->find($id);

DELETE FROM `student`
WHERE `id` IN ('8')
---
	public function delete($id)
	{
		$students = new Student();
		$result = $students->delete($id);